"""
    数据基本运算
        数据
            变量:操作数据
                变量名称 = 数据
            类型:
                整数   小数    字符串
                100   1.2     "100"

        运算
"""
# 1. 整形字面值
# -- 十进制DEC:每位用十种状态计数，逢十进一，写法是0~9。
data01 = 20
# -- 二进制BIN:每位用二种状态计数，逢二进一，写法是0~1。
data02 = 0b10
# -- 八进制OCT:每位用八种状态计数，逢八进一，写法是0~7。
data03 = 0o20
# -- 十六进制HEX:每位用十六种状态计数，逢十六进一，写法是0~9  a~f。
data04 = 0x20

# 2. 浮点型字面值
# -- 小数
data05 = 0.000000000000000000000000000001
# -- 科学计数法   ? *10 ?   ->   ? e ?
data06 = 1e-30








