"""
    总结函数参数
        实际参数：与形参对应
            位置实参:按顺序
                函数名称(数据1,数据2,数据3)
            关键字实参:按名称
                函数名称(形参名1=数据1,形参名2=数据2)
            序列实参:拆
                函数名称(*序列)
            字典实参:拆
                函数名称(**字典)
        形式参数:规定实参
            默认形参:实参可选
                def 函数名称(形参名1=数据1,形参名2=数据2)
            位置形参:实参必填
                def 函数名称(形参名1,形参名2)
            命名关键字形参:必须是关键字实参
                def 函数名称(*args,形参名1,形参名2)
                def 函数名称(*,形参名1,形参名2)
            星号元组形参:位置实参数量无限 合
                def 函数名称(*args)
            双星号字典形参:关键字实参数量无限 合
                def 函数名称(**kwargs)
"""

